Notes/daily/2021-11-03.org
:PROPERTIES:
:ID:       aa2cd3c7-5800-4ee7-af15-64994d0a1f29
:END:
#+title: 2021-11-03
* Project breakdown
In the last note I mentioned creating a project breakdown, which is a decomposition of project tasks. The breakdown I made then was acceptable, but I still feel that it missed some points, so I'm going to make another one here

I'm going to break the project into broad steps, and then break each of the steps down into smaller substeps

- Initial research step
  - Check that people want it
  - Check if there's a need for it
  - Check that there are no existing solutions that fully encompass the use-case
- Initial planning step
  - Plan basic outline of features
  - Plan basic timeline of feature implementation
- Development cycle
  - Research
    - Research into what future users want (owner interviews)
    - Research into what solutions already exist
    - Research into what implementations already exist
    - Research into what libraries exist to implement these things
      - Speed of libraries (benchmarking)
      - API complexity & documentation quality of libraries
      - Popularity of libraries
    - Prototyping
      - Make something simple with one or two of the best quality libraries to test them out
  - Development
    - Write the feature
    - Testing
      - Write tests (May be placed before feature writing step in 'test driven development')
      - Run tests (May be placed alongside feature writing step in 'test driven development')
      - Fix failing cases (If the tests don't pass, figure out why and fix it)
- Deployment
  - Deployment to non-critical systems
    - Sky@Pi
    - Mini'sMacMini
    - Possible DC2 deployment (DC2 is a slated server improvement, it is (as of now) unclear if it will be production critical or when exactly it will occur)
  - Deployment to critical servers
    - DC1 deployment (DC1 is the main server, currently hosting https://clicksminuteper.net. While the software running on it needs an overhaul, it's still a production-critical server)
    - Possible DC2 deployment (DC2 is a slated server improvement, it is (as of now) unclear if it will be production critical or when exactly it will occur)
- Evaluation
  - Evaluation of final product
    - Self evaluation
    - Peer evaluation
  - Evaluation of project management
