Notes/daily/2021-11-03.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-11-03</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-11-03</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-12-12.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2b547d6">Project breakdown</a></li>
</ul>
</div>
</div>
<div id="outline-container-org2b547d6" class="outline-2">
<h2 id="org2b547d6">Project breakdown</h2>
<div class="outline-text-2" id="text-org2b547d6">
<p>
In the last note I mentioned creating a project breakdown, which is a decomposition of project tasks. The breakdown I made then was acceptable, but I still feel that it missed some points, so I'm going to make another one here
</p>

<p>
I'm going to break the project into broad steps, and then break each of the steps down into smaller substeps
</p>

<ul class="org-ul">
<li>Initial research step
<ul class="org-ul">
<li>Check that people want it</li>
<li>Check if there's a need for it</li>
<li>Check that there are no existing solutions that fully encompass the use-case</li>
</ul></li>
<li>Initial planning step
<ul class="org-ul">
<li>Plan basic outline of features</li>
<li>Plan basic timeline of feature implementation</li>
</ul></li>
<li>Development cycle
<ul class="org-ul">
<li>Research
<ul class="org-ul">
<li>Research into what future users want (owner interviews)</li>
<li>Research into what solutions already exist</li>
<li>Research into what implementations already exist</li>
<li>Research into what libraries exist to implement these things
<ul class="org-ul">
<li>Speed of libraries (benchmarking)</li>
<li>API complexity &amp; documentation quality of libraries</li>
<li>Popularity of libraries</li>
</ul></li>
<li>Prototyping
<ul class="org-ul">
<li>Make something simple with one or two of the best quality libraries to test them out</li>
</ul></li>
</ul></li>
<li>Development
<ul class="org-ul">
<li>Write the feature</li>
<li>Testing
<ul class="org-ul">
<li>Write tests (May be placed before feature writing step in 'test driven development')</li>
<li>Run tests (May be placed alongside feature writing step in 'test driven development')</li>
<li>Fix failing cases (If the tests don't pass, figure out why and fix it)</li>
</ul></li>
</ul></li>
</ul></li>
<li>Deployment
<ul class="org-ul">
<li>Deployment to non-critical systems
<ul class="org-ul">
<li>Sky@Pi</li>
<li>Mini'sMacMini</li>
<li>Possible DC2 deployment (DC2 is a slated server improvement, it is (as of now) unclear if it will be production critical or when exactly it will occur)</li>
</ul></li>
<li>Deployment to critical servers
<ul class="org-ul">
<li>DC1 deployment (DC1 is the main server, currently hosting <a href="https://clicksminuteper.net">https://clicksminuteper.net</a>. While the software running on it needs an overhaul, it's still a production-critical server)</li>
<li>Possible DC2 deployment (DC2 is a slated server improvement, it is (as of now) unclear if it will be production critical or when exactly it will occur)</li>
</ul></li>
</ul></li>
<li>Evaluation
<ul class="org-ul">
<li>Evaluation of final product
<ul class="org-ul">
<li>Self evaluation</li>
<li>Peer evaluation</li>
</ul></li>
<li>Evaluation of project management</li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>
